import java.util.Arrays;

//Завдання 5
//Створіть проект. Створіть змінну типу byte, надайте їй значення 99999,
// виведіть значення цієї змінної в консоль. За виникнення помилки, використовуючи коментарі,
// напишіть, у чому помилка та привласніть це значення до відповідного типу даних.
public class Less_2_Task_5_byte {
    public static void main(String[] args) {
        int num1=99999;// Виникла помилка, бо byte [-128.....127],тому краще тип даних int
        System.out.println(num1);

    }
}
